package main

import (
	"crypto/rand"
	"fmt"
	"strings"
)

var alphabet = []rune{'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', // 0
	'〇', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '百', '千', '万', '億', '兆', // 1
	'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ', 'サ', 'シ', 'ス', 'セ', 'ソ', 'タ', // 2
	'チ', 'ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'マ', 'ミ', // 3
	'ム', 'メ', 'モ', 'ヤ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ヰ', 'ヱ', 'ヲ', 'ン', // 4
	'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ', 'た', // 5
	'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま', 'み', // 6
	'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'ゐ', 'ゑ', 'を', 'ん', // 7
	'乙', '人', '儿', '入', '八', '冂', '冫', '几', '凵', '刀', '力', '勹', '匕', '匚', '匸', '卜', // 8
	'卩', '厂', '厶', '又', '口', '囗', '土', '士', '夂', '夊', '夕', '大', '女', '子', '宀', '寸', // 9
	'小', '尢', '尸', '屮', '山', '川', '工', '己', '巾', '干', '幺', '广', '廴', '廾', '弋', '弓', // A
	'彐', '彡', '彳', '心', '戈', '户', '手', '支', '攴', '文', '斗', '斤', '方', '无', '日', '曰', // B
	'月', '木', '欠', '止', '歹', '殳', '毋', '比', '毛', '氏', '气', '水', '火', '爪', '父', '爻', // C
	'爿', '片', '牙', '牛', '犬', '玄', '玉', '瓜', '瓦', '甘', '生', '用', '田', '疋', '疒', '癶', // D
	'白', '皮', '皿', '目', '矛', '矢', '石', '示', '禸', '禾', '穴', '立', '竹', '米', '纟', '缶', // E
	'网', '羊', '羽', '老', '而', '耒', '耳', '聿', '肉', '臣', '自', '至', '臼', '舌', '舛', '舟', // F
	//'艮', '色', '艸', '虍', '虫', '血', '行', '衣', '襾', '见', '角', '讠', '谷', '豆', '豕', '豸',
	//'贝', '赤', '走', '足', '身', '车', '辛', '辰', '辵', '邑', '酉', '釆', '里', '金', '长', '门',
	//'阜', '隶', '隹', '雨', '青', '非', '面', '革', '韦', '韭', '音', '页', '风', '飞', '食', '首',
	//'香', '马', '骨', '高', '髟', '斗', '鬯', '鬲', '鬼', '鱼', '鸟', '卤', '鹿', '麦', '麻', '黃',
	//'黍', '黑', '黹', '黾', '鼎', '鼓', '鼠', '鼻', '齐', '齿', '龙', '龟', '龠', '', '', '
}

func FromBytes(bytes []byte) string {
	var sb strings.Builder
	for _, b := range bytes {
		sb.WriteRune(alphabet[b])
	}
	return sb.String()
}

//func ToBytes(runes ...rune) []byte {
//	result := []byte{0, 0}
//	for _, r := runes {
//
//	}
//}

func main() {
	fmt.Println("Hello Hexakana")

	byteArray := make([]byte, 32)
	rand.Read(byteArray)
	fmt.Printf("%x\n", byteArray)
	str1 := FromBytes(byteArray)
	fmt.Println("String:", str1)

}
